/* 
1. დაწერე ფუნქცია, რომელიც მიიღებს a და b პარამეტრებს და მოახდენს მათ ვალიდაციას. თუ, ორივე პარამეტრის ტიპი შეესაბამება რიცხვით მნიშვნელობას ფუნქცია აბრუნებს მათ ჯამს, სხვა შემთხვევაში აბრუნებს შეტყობინებას "საჭიროა პარამეტრად გადაეცეს რიცხვი".
*/

function numSum(a, b) {
    if (a === undefined || b === undefined) return 'გადმოეცი ორი პარამეტრი'
    if (typeof a !== 'number' || typeof b !== 'number') return 'საჭიროა პარამეტრად გადაეცეს რიცხვები!'
    return a + b
}

console.log(numSum('3', 7));


